rodan/atlas430/driverlib/MSP430FR57xx/cs.c
//*****************************************************************************
//
// cs.c - Driver for the cs Module.
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup cs_api cs
//! @{
//
//*****************************************************************************

#include "inc/hw_memmap.h"

#ifdef __MSP430_HAS_CS__
#include "cs.h"

#include <assert.h>

//*****************************************************************************
//
// The following value is used by CS_getACLK, CS_getSMCLK, CS_getMCLK to
// determine the operating frequency based on the available DCO frequencies.
//
//*****************************************************************************
#define CS_DCO_FREQ_1                                                    5330000
#define CS_DCO_FREQ_2                                                    6670000
#define CS_DCO_FREQ_3                                                    8000000
#define CS_DCO_FREQ_4                                                   16000000
#define CS_DCO_FREQ_5                                                   20000000
#define CS_DCO_FREQ_6                                                   24000000

//*****************************************************************************
//
// Internal very low power VLOCLK, low frequency oscillator with 10kHz typical
// frequency, internal low-power oscillator MODCLK with 5 MHz typical
// frequency and LFMODCLK is MODCLK divided by 128.
//
//*****************************************************************************
#define CS_VLOCLK_FREQUENCY                                                10000
#define CS_MODCLK_FREQUENCY                                              5000000
#define CS_LFMODCLK_FREQUENCY                                              39062

//*****************************************************************************
//
// The following value is used by CS_turnOnXT1, CS_bypassXT1,
// CS_turnOnXT1WithTimeout, CS_bypassXT1WithTimeout to properly set the XTS bit.
// This frequnecy threshold is specified in the User's Guide
//
//*****************************************************************************
#define XT1_FREQUENCY_THRESHOLD                                         50000

//*****************************************************************************
//
// The XT1 crystal frequency. Should be set with CS_externalClockSourceInit if
// XT1 is used and user intends to invoke CS_getSMCLK, CS_getMCLK, CS_getACLK
// and turnOnXT1, XT1ByPass, turnOnXT1WithTimeout, XT1ByPassWithTimeout.
//
//*****************************************************************************
static uint32_t privateXT1ClockFrequency = 0;

//*****************************************************************************
//
// The XT2 crystal frequency. Should be set with CS_externalClockSourceInit if
// XT2 is used and user intends to invoke CS_getSMCLK, CS_getMCLK and
// CS_getACLK.
//
//*****************************************************************************
static uint32_t privateXT2ClockFrequency = 0;

static uint32_t privateCSSourceClockFromDCO (uint8_t clockdivider)
{
    uint32_t CLKFrequency = 0;

    if (HWREG16(CS_BASE + OFS_CSCTL1)& DCORSEL) {
        switch (HWREG16(CS_BASE + OFS_CSCTL1)& DCOFSEL_3) {
            case DCOFSEL_3:
                CLKFrequency=CS_DCO_FREQ_6/clockdivider;
                break;
            case DCOFSEL_2:
                CLKFrequency=CS_DCO_FREQ_4/clockdivider;
                break;
            case DCOFSEL_1:
                CLKFrequency=CS_DCO_FREQ_5/clockdivider;
                break;
            default:
                CLKFrequency=CS_DCO_FREQ_4/clockdivider;
                break;
        }

    } else {
        switch (HWREG16(CS_BASE + OFS_CSCTL1)& DCOFSEL_3) {
            case DCOFSEL_3:
                CLKFrequency=CS_DCO_FREQ_3/clockdivider;
                break;
            case DCOFSEL_2:
                CLKFrequency=CS_DCO_FREQ_1/clockdivider;
                break;
            case DCOFSEL_1:
                CLKFrequency=CS_DCO_FREQ_2/clockdivider;
                break;
            default:
                CLKFrequency=CS_DCO_FREQ_1/clockdivider;
                break;

        }
    }

    return (CLKFrequency);
}

static uint32_t privateCSComputeCLKFrequency (uint16_t CLKSource,
    uint16_t CLKSourceDivider
    )
{
    uint32_t CLKFrequency = 0;
    uint8_t CLKSourceFrequencyDivider = 1;
    uint8_t i = 0;

    // Determine Frequency divider
    for ( i = 0; i < CLKSourceDivider; i++){
        CLKSourceFrequencyDivider *= 2;
    }

    //Unlock CS control register
    HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    // Determine clock source based on CLKSource
    switch (CLKSource){

        // If XT1 is selected as clock source
        case SELM__XT1CLK:
            CLKFrequency = (privateXT1ClockFrequency /
                            CLKSourceFrequencyDivider);

            //Check if XT1OFFG is not set. If fault flag is set
            //VLO is used as source clock
            if (HWREG8(CS_BASE + OFS_CSCTL5) & XT1OFFG){
                HWREG8(CS_BASE + OFS_CSCTL5) &= ~(XT1OFFG);
                //Clear OFIFG fault flag
                HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

                if (HWREG8(CS_BASE + OFS_CSCTL5) & XT1OFFG){
                    CLKFrequency = CS_VLOCLK_FREQUENCY;
                }
            }
            break;

        case SELM__VLOCLK:
            CLKFrequency =
                (CS_VLOCLK_FREQUENCY / CLKSourceFrequencyDivider);
            break;

        case SELM__DCOCLK:
            CLKFrequency =
            privateCSSourceClockFromDCO( CLKSourceFrequencyDivider);

            break;

        case SELM__XT2CLK:
            CLKFrequency =
                (privateXT2ClockFrequency / CLKSourceFrequencyDivider);

            if (HWREG8(CS_BASE + OFS_CSCTL5) & XT2OFFG){

