rodan/atlas430/driverlib/MSP430FR57xx/cs.c
              HWREG8(CS_BASE + OFS_CSCTL5) &=  ~XT2OFFG;
              //Clear OFIFG fault flag
              HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
            }

            if (HWREG8(CS_BASE + OFS_CSCTL5) & XT2OFFG){
                CLKFrequency = CS_MODCLK_FREQUENCY;
            }
            break;
    }

    // Lock CS control register
    HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;

    return (CLKFrequency) ;
}

void CS_setExternalClockSource (uint32_t XT1CLK_frequency,
    uint32_t XT2CLK_frequency
    )
{
    privateXT1ClockFrequency = XT1CLK_frequency;
    privateXT2ClockFrequency = XT2CLK_frequency;
}

void CS_initClockSignal (uint8_t selectedClockSignal,
    uint16_t clockSource,
    uint16_t clockSourceDivider
    )
{

	//Verify User has selected a valid Frequency divider
	assert(
		(CS_CLOCK_DIVIDER_1 == clockSourceDivider) ||
		(CS_CLOCK_DIVIDER_2 == clockSourceDivider) ||
		(CS_CLOCK_DIVIDER_4 == clockSourceDivider) ||
		(CS_CLOCK_DIVIDER_8 == clockSourceDivider) ||
		(CS_CLOCK_DIVIDER_16 == clockSourceDivider) ||
		(CS_CLOCK_DIVIDER_32 == clockSourceDivider)
		);

	// Unlock CS control register
	HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    uint16_t temp = HWREG16(CS_BASE + OFS_CSCTL3);
	switch (selectedClockSignal){
		case CS_ACLK:
			//verify User has selected a valid clock source for ACLK
			assert(
					(CS_XT1CLK_SELECT == clockSource) ||
					(CS_VLOCLK_SELECT == clockSource) ||
					(CS_DCOCLK_SELECT == clockSource) ||
					(CS_XT2CLK_SELECT == clockSource)
					);
			clockSourceDivider = clockSourceDivider << 8;
			clockSource = clockSource << 8;

			HWREG16(CS_BASE + OFS_CSCTL2) &= ~(SELA_7);
			HWREG16(CS_BASE + OFS_CSCTL2) |= (clockSource);
			HWREG16(CS_BASE + OFS_CSCTL3) = temp & ~(DIVA0 + DIVA1 + DIVA2) |
                                                clockSourceDivider;
			break;
		case CS_SMCLK:
			assert(
				(CS_XT1CLK_SELECT == clockSource) ||
				(CS_VLOCLK_SELECT == clockSource) ||
				(CS_DCOCLK_SELECT == clockSource) ||
				(CS_XT2CLK_SELECT == clockSource)
				);

			clockSource = clockSource << 4;
			clockSourceDivider = clockSourceDivider << 4;

			HWREG16(CS_BASE + OFS_CSCTL2) &= ~(SELS_7);
			HWREG16(CS_BASE + OFS_CSCTL2) |= clockSource;
			HWREG16(CS_BASE + OFS_CSCTL3) = temp & ~(DIVS0 + DIVS1 + DIVS2) |
                                                clockSourceDivider;
			break;
		case CS_MCLK:
			assert(
			(CS_XT1CLK_SELECT == clockSource) ||
			(CS_VLOCLK_SELECT == clockSource) ||
			(CS_DCOCLK_SELECT == clockSource) ||
			(CS_XT2CLK_SELECT == clockSource)
			);

			HWREG16(CS_BASE + OFS_CSCTL2) &= ~(SELM_7);
			HWREG16(CS_BASE + OFS_CSCTL2) |= clockSource;
			HWREG16(CS_BASE + OFS_CSCTL3) = temp & ~(DIVM0 + DIVM1 + DIVM2) |
                                                clockSourceDivider;
			break;
	}

	// Lock CS control register
	HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;

}

void CS_turnOnXT1 (uint16_t xt1drive
    )
{
	assert(privateXT1ClockFrequency !=0);

    assert((xt1drive == CS_XT1_DRIVE0 ) ||
        (xt1drive == CS_XT1_DRIVE1 ) ||
        (xt1drive == CS_XT1_DRIVE2 ) ||
        (xt1drive == CS_XT1_DRIVE3 ));

	// Unlock CS control register
	HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    //Switch ON XT1 oscillator
    HWREG16(CS_BASE + OFS_CSCTL4) &= ~XT1OFF;

    //Highest drive setting for turnOnXT1up
    HWREG16(CS_BASE + OFS_CSCTL4_L) |= XT1DRIVE1_L + XT1DRIVE0_L;

	//If user is using XT1 in HF mode
	if(privateXT1ClockFrequency>XT1_FREQUENCY_THRESHOLD){
		HWREG16(CS_BASE + OFS_CSCTL4) |= XTS;
		HWREG16(CS_BASE + OFS_CSCTL4) &= ~XT1BYPASS;
	}else{
		HWREG16(CS_BASE + OFS_CSCTL4) &= ~(XTS+XT1BYPASS);
	}

    //Wait for Crystal to stabilize
    while (HWREG8(CS_BASE + OFS_CSCTL5) & XT1OFFG)
    {
        //Clear OSC flaut Flags fault flags
        HWREG8(CS_BASE + OFS_CSCTL5) &= ~(XT1OFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    //set requested Drive mode
    HWREG16(CS_BASE + OFS_CSCTL4) = ( HWREG16(CS_BASE + OFS_CSCTL4) &
                                         ~(XT1DRIVE_3)
                                         ) |
                                       (xt1drive);

    // Lock CS control register
	HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;

}

void CS_turnOnSMCLK (void)
{
    // Unlock CS control register
    HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    HWREG16(CS_BASE + OFS_CSCTL4) &= ~SMCLKOFF;

    // Lock CS control register
    HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

void CS_turnOffSMCLK (void)
{
    // Unlock CS control register
    HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    HWREG16(CS_BASE + OFS_CSCTL4) |= SMCLKOFF;

    // Lock CS control register
    HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

void CS_bypassXT1 (void)
{
	//Verify user has set frequency of XT1 with SetExternalClockSource
	assert(privateXT1ClockFrequency!=0);

	// Unlock CS control register
	HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

	if(privateXT1ClockFrequency>XT1_FREQUENCY_THRESHOLD){
		// Set XT1 in HF mode switch off XT1 Oscillator and enable BYPASS mode
		HWREG16(CS_BASE + OFS_CSCTL4) |= (XTS + XT1BYPASS +XT1OFF);
	}else {
		// Set XT1 in LF mode Switch off XT1 oscillator and enable BYPASS mode
		HWREG16(CS_BASE + OFS_CSCTL4) &= ~XTS;
		HWREG16(CS_BASE + OFS_CSCTL4) |= (XT1BYPASS + XT1OFF);
	}

		// Set XT1 in LF mode Switch off XT1 oscillator and enable BYPASS mode
	HWREG16(CS_BASE + OFS_CSCTL4) |= (XT1BYPASS + XT1OFF);

	//Wait until XT1 stabilizes
	while (HWREG8(CS_BASE + OFS_CSCTL5) & XT1OFFG)
	{
		//Clear OSC flaut Flags fault flags
		HWREG8(CS_BASE + OFS_CSCTL5) &= ~(XT1OFFG);

		// Clear the global fault flag. In case the XT1 caused the global fault
		// flag to get set this will clear the global error condition. If any
		// error condition persists, global flag will get again.
		HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
	}
	// Lock CS control register
	HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

bool CS_turnOnXT1WithTimeout (uint16_t xt1drive,
    uint32_t timeout
    )
{
	assert(privateXT1ClockFrequency !=0);

