rodan/atlas430/driverlib/MSP430FR57xx/cs.c
	assert((xt1drive == CS_XT1_DRIVE0 ) ||
		(xt1drive == CS_XT1_DRIVE1 ) ||
		(xt1drive == CS_XT1_DRIVE2 ) ||
		(xt1drive == CS_XT1_DRIVE3 ));

    assert(timeout > 0);

	// Unlock CS control register
	HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    //Switch ON XT1 oscillator
    HWREG16(CS_BASE + OFS_CSCTL4) &= ~XT1OFF;

	//Highest drive setting for turnOnXT1up
	HWREG16(CS_BASE + OFS_CSCTL4_L) |= XT1DRIVE1_L + XT1DRIVE0_L;

	//If user is using XT1 in HF mode
	if(privateXT1ClockFrequency>XT1_FREQUENCY_THRESHOLD){
		HWREG16(CS_BASE + OFS_CSCTL4) |= XTS;
		HWREG16(CS_BASE + OFS_CSCTL4) &= ~XT1BYPASS;
	}else{
	//If user is using XT1 in HF mode
		HWREG16(CS_BASE + OFS_CSCTL4) &= ~(XTS+XT1BYPASS);
	}

	while ((HWREG8(CS_BASE + OFS_CSCTL5) & XT1OFFG) && --timeout)
	{
		//Clear OSC fault Flags fault flags
		HWREG8(CS_BASE + OFS_CSCTL5) &= ~(XT1OFFG);

		// Clear the global fault flag. In case the XT1 caused the global fault
		// flag to get set this will clear the global error condition. If any
		// error condition persists, global flag will get again.
		HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

	}

	if(timeout){

	    //set requested Drive mode
		HWREG16(CS_BASE + OFS_CSCTL4) = ( HWREG16(CS_BASE + OFS_CSCTL4) &
												 ~(XT1DRIVE_3)
												 ) |
											   (xt1drive);
		// Lock CS control register
		HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
		return (STATUS_SUCCESS);
	} else   {
		// Lock CS control register
		HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
		return (STATUS_FAIL);
	}
}

bool CS_bypassXT1WithTimeout (uint32_t timeout
    )
{
    assert(privateXT1ClockFrequency !=0);

    assert(timeout > 0);

	//Unlock CS control register
	HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

	if(privateXT1ClockFrequency>XT1_FREQUENCY_THRESHOLD){
		// Set XT1 in HF mode switch off XT1 Oscillator and enable BYPASS mode
		HWREG16(CS_BASE + OFS_CSCTL4) |= (XTS + XT1BYPASS +XT1OFF);
	}else {
		// Set XT1 in LF mode Switch off XT1 oscillator and enable BYPASS mode
		HWREG16(CS_BASE + OFS_CSCTL4) &= ~XTS;
		HWREG16(CS_BASE + OFS_CSCTL4) |= (XT1BYPASS + XT1OFF);
	}

	while ((HWREG8(CS_BASE + OFS_CSCTL5) & XT1OFFG) && --timeout)
	{
		//Clear OSC fault Flags fault flags
		HWREG8(CS_BASE + OFS_CSCTL5) &= ~(XT1OFFG);

		// Clear the global fault flag. In case the XT1 caused the global fault
		// flag to get set this will clear the global error condition. If any
		// error condition persists, global flag will get again.
		HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

	}

	// Lock CS control register
	HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;

    if (timeout){
        return (STATUS_SUCCESS);
    } else {
        return (STATUS_FAIL);
    }
}

void CS_turnOffXT1 (void)
{
	//Unlock CS control register
	HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;
    //Switch off XT1 oscillator
    HWREG16(CS_BASE + OFS_CSCTL4) |= XT1OFF;
    // Lock CS control register
	HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

void CS_turnOnXT2 (uint16_t xt2drive
    )
{
	assert(privateXT2ClockFrequency !=0);

    assert((xt2drive == CS_XT2_DRIVE_4MHZ_8MHZ  ) ||
    	   (xt2drive == CS_XT2_DRIVE_8MHZ_16MHZ ) ||
           (xt2drive == CS_XT2_DRIVE_16MHZ_24MHZ )||
           (xt2drive == CS_XT2_DRIVE_24MHZ_32MHZ ));

	//Unlock CS control register
	HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;
    
    //Switch on XT2 oscillator
    HWREG16(CS_BASE + OFS_CSCTL4) &= ~XT2OFF;

    //Disable XT2BYPASS mode and Switch on XT2 oscillator
    HWREG16(CS_BASE + OFS_CSCTL4) &= ~XT2BYPASS;

    while (HWREG8(CS_BASE + OFS_CSCTL5) & XT2OFFG){
     //Clear OSC flaut Flags
     HWREG8(CS_BASE + OFS_CSCTL5) &= ~(XT2OFFG);

     //Clear OFIFG fault flag
     HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    HWREG16(CS_BASE + OFS_CSCTL4) = ( HWREG16(CS_BASE + OFS_CSCTL4) &
                                         ~(CS_XT2_DRIVE_24MHZ_32MHZ)
                                         ) | (xt2drive);

    // Lock CS control register
	HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;

}

void CS_bypassXT2 (void)
{
	//Verify user has initialized value of XT2Clock
	assert(privateXT2ClockFrequency !=0);

	//Unlock CS control register
	HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    //Switch off XT2 oscillator and set it to BYPASS mode
    HWREG16(CS_BASE + OFS_CSCTL4) |= ( XT2BYPASS + XT2OFF );

	 while (HWREG8(CS_BASE + OFS_CSCTL5) & XT2OFFG){
     //Clear OSC fault Flags
     HWREG8(CS_BASE + OFS_CSCTL5) &= ~(XT2OFFG);

     //Clear OFIFG fault flag
     HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    // Lock CS control register
	HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

bool CS_turnOnXT2WithTimeout (uint16_t xt2drive,
    uint32_t timeout
    )
{
	//Verify user has initialized value of XT2Clock
	assert(privateXT2ClockFrequency !=0);

    assert(timeout > 0);

	//Unlock CS control register
	HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    //Switch on XT2 oscillator
    HWREG16(CS_BASE + OFS_CSCTL4) &= ~XT2OFF;

	// Disable XT2BYPASS mode
    HWREG16(CS_BASE + OFS_CSCTL4) &= ~XT2BYPASS;

	while ((HWREG8(CS_BASE + OFS_CSCTL5) & XT2OFFG) && --timeout)
	{
		//Clear OSC fault Flags fault flags
		HWREG8(CS_BASE + OFS_CSCTL5) &= ~(XT2OFFG);

		// Clear the global fault flag. In case the XT1 caused the global fault
		// flag to get set this will clear the global error condition. If any
		// error condition persists, global flag will get again.
		HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

	}

    if (timeout){
		//Set drive strength for XT2
	    HWREG16(CS_BASE + OFS_CSCTL4) = ( HWREG16(CS_BASE + OFS_CSCTL4) &
	                                         ~(CS_XT2_DRIVE_24MHZ_32MHZ)
	                                         ) |
	                                       (xt2drive);

        // Lock CS control register
        HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;

        return (STATUS_SUCCESS);
    } else   {
        return (STATUS_FAIL);
    }
}

bool CS_bypassXT2WithTimeout (uint32_t timeout
    )
{
	//Verify user has initialized value of XT2Clock
	assert(privateXT2ClockFrequency !=0);

    assert(timeout > 0);

	//Unlock CS control register
	HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

	//Switch off XT2 oscillator and enable BYPASS mode
    HWREG16(CS_BASE + OFS_CSCTL4) |= (XT2BYPASS + XT2OFF );

	while ((HWREG8(CS_BASE + OFS_CSCTL5) & XT2OFFG) && --timeout)
	{
		//Clear OSC fault Flags fault flags
		HWREG8(CS_BASE + OFS_CSCTL5) &= ~(XT2OFFG);

		// Clear the global fault flag. In case the XT1 caused the global fault
		// flag to get set this will clear the global error condition. If any
		// error condition persists, global flag will get again.
		HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

