rodan/atlas430/driverlib/MSP430FR57xx/cs.c
	}

    // Lock CS control register
	HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;

    if (timeout){
        return (STATUS_SUCCESS);
    } else   {
        return (STATUS_FAIL);
    }
}

void CS_turnOffXT2 (void)
{
	//Unlock CS control register
	HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    //Switch off XT2 oscillator
    HWREG16(CS_BASE + OFS_CSCTL4) |= XT2OFF;

    // Lock CS control register
	HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

void CS_enableClockRequest (uint8_t selectClock
    )
{
	assert(
			(CS_ACLK  == selectClock )||
			(CS_SMCLK == selectClock )||
			(CS_MCLK  == selectClock )||
			(CS_MODOSC== selectClock ));

	//Unlock CS control register
	HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    HWREG8(CS_BASE + OFS_CSCTL6) |= selectClock;

    // Lock CS control register
	HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

void CS_disableClockRequest (uint8_t selectClock
    )
{
	assert(
			(CS_ACLK  == selectClock )||
			(CS_SMCLK == selectClock )||
			(CS_MCLK  == selectClock )||
			(CS_MODOSC== selectClock ));

 	//Unlock CS control register
	HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    HWREG8(CS_BASE + OFS_CSCTL6) &= ~selectClock;

    // Lock CS control register
	HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

uint8_t CS_getFaultFlagStatus (uint8_t mask
    )
{
    assert(mask <= CS_turnOffXT2G );
    return (HWREG8(CS_BASE + OFS_CSCTL5) & mask);
}

void CS_clearFaultFlag (uint8_t mask
    )
{
    assert(mask <= CS_turnOffXT2G );

	//Unlock CS control register
	HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    HWREG8(CS_BASE + OFS_CSCTL5) &= ~mask;

	// Lock CS control register
	HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;

}

uint32_t CS_getACLK (void)
{
	//Find ACLK source
	uint16_t ACLKSource = (HWREG16(CS_BASE + OFS_CSCTL2) & SELA_7);
	ACLKSource = ACLKSource >> 8;

	//Find ACLK frequency divider
	uint16_t ACLKSourceDivider =  HWREG16(CS_BASE + OFS_CSCTL3) & SELA_7;
	ACLKSourceDivider = ACLKSourceDivider >>8;

	return (privateCSComputeCLKFrequency(
					ACLKSource,
					ACLKSourceDivider));
}

uint32_t CS_getSMCLK (void)
{
	//Find SMCLK source
	uint16_t SMCLKSource = HWREG8(CS_BASE + OFS_CSCTL2) & SELS_7 ;

	SMCLKSource = SMCLKSource >> 4;

	//Find SMCLK frequency divider
	uint16_t SMCLKSourceDivider = HWREG16(CS_BASE + OFS_CSCTL3) & SELS_7;
	SMCLKSourceDivider = SMCLKSourceDivider >> 4;

	return (privateCSComputeCLKFrequency(
				SMCLKSource,
				SMCLKSourceDivider )
			);
}

uint32_t CS_getMCLK (void)
{

	//Find MCLK source
	uint16_t MCLKSource = (HWREG16(CS_BASE + OFS_CSCTL2) & SELM_7);
	//Find MCLK frequency divider
	uint16_t MCLKSourceDivider =  HWREG16(CS_BASE + OFS_CSCTL3) & SELM_7;

	return (privateCSComputeCLKFrequency(
				MCLKSource,
				MCLKSourceDivider )
			);
}

uint16_t CS_clearAllOscFlagsWithTimeout(uint32_t timeout
                                             )
{
    assert(timeout > 0);

	//Unlock CS control register
	HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    do {

      // Clear all osc fault flags
      HWREG8(CS_BASE + OFS_CSCTL5) &= ~(XT1OFFG + XT2OFFG );

      // Clear the global osc fault flag.
      HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

      // Check XT1 fault flags
    } while ((HWREG8(SFR_BASE + OFS_SFRIFG1) & OFIFG) && --timeout);

    // Lock CS control register
	HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;

    return (HWREG8(CS_BASE + OFS_CSCTL5) & (XT1OFFG + XT2OFFG));
}

void CS_setDCOFreq(uint16_t dcorsel,
		uint16_t dcofsel)
{

	//Verify User has selected a valid frequency option
	assert(
			(dcofsel==CS_DCOFSEL_0)||
			(dcofsel==CS_DCOFSEL_1)||
			(dcofsel==CS_DCOFSEL_2)||
			(dcofsel==CS_DCOFSEL_3));
	//Verify User has selected a valid frequency option

	//Verify user has selected a valid DCO Frequency Range option
	assert(
			(dcorsel==CS_DCORSEL_0)||
			(dcorsel==CS_DCORSEL_1));

	uint16_t tempCSCTL3 = 0;
    //Unlock CS control register
	HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    //Assuming ACLK, SMCLK, and MCLK are sourced from DCO
    //Store CSCTL3 settings to recover later
    tempCSCTL3 = HWREG16(CS_BASE + OFS_CSCTL3);

    //Keep overshoot transient within specification by setting clk
    //sources to divide by 4
    //Clear the DIVA & DIVS & DIVM masks (~0x777) and set all fields
    //to 4 divider
    HWREG16(CS_BASE + OFS_CSCTL3) = HWREG16(CS_BASE + OFS_CSCTL3) &
        (~(0x777)) | DIVA1 | DIVS1 | DIVM1;

	// Set user's frequency selection for DCO
	HWREG16(CS_BASE + OFS_CSCTL1) = (dcorsel + dcofsel);

    //Delay by ~10us to let DCO settle. cycles to wait = 20 cycles buffer + 
    //(10us * (x MHz/4))
    switch(dcofsel)
    {
        case(CS_DCOFSEL_0):
            //5.33 MHz or 16 MHz
            (dcorsel == CS_DCORSEL_0) ? __delay_cycles(34) : __delay_cycles(60);
            break;
        case(CS_DCOFSEL_1):
            //6.67 MHz or 20 MHz
            (dcorsel == CS_DCORSEL_0) ? __delay_cycles(37) : __delay_cycles(70);
            break;
        case(CS_DCOFSEL_2):
            //5.33 MHz or 16 MHz
            (dcorsel == CS_DCORSEL_0) ? __delay_cycles(34) : __delay_cycles(60);
        break;
        case(CS_DCOFSEL_3):
            //8 MHz or 24 MHz
            (dcorsel == CS_DCORSEL_0) ? __delay_cycles(40) : __delay_cycles(80);
            break;
        default:
            //Should not be used, take caution by doing max
            (dcorsel == CS_DCORSEL_0) ? __delay_cycles(40) : __delay_cycles(80);
            break;
    }

    //Set all dividers
    HWREG16(CS_BASE + OFS_CSCTL3) = tempCSCTL3;

	// Lock CS control register
	HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

#endif
//*****************************************************************************
//
//! Close the doxygen group for cs_api
//! @}
//
//*****************************************************************************
